# HermiteSplineTangents Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HermiteSplineTangents Members
HermiteSplineTangents Class Constructors Methods Properties See Also
---
The HermiteSplineTangents type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HermiteSplineTangents | Constructs a new default instance of the class, with tangent vectors uninitialized. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the HermiteSplineTangents |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EndTangent | The tangent vector at the end of the curve. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StartTangent | The tangent vector at the start of the curve. |

# See Also
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace